{
    "meta_data": {
        "title": "HIBPool: Hierarchical Information Bottleneck Guided Pooling for Graph Classification",
        "authors": [
            "John Doe",
            "Jane Smith"
        ],
        "affiliations": [
            "University of Graph Theory",
            "Graph Research Institute"
        ],
        "abstract": "We introduce HIBPool, a novel graph pooling method that leverages community structures and the Information Bottleneck principle to learn effective graph-level representations. Our approach differentiates itself by capturing discriminative community structures and minimizing redundancy, leading to superior performance in graph classification benchmarks. Extensive experiments validate the efficacy and resilience of our method, showcasing its advantage over existing pooling methods.",
        "keywords": [
            "Graph Neural Networks",
            "Graph Pooling",
            "Information Bottleneck",
            "Graph Classification"
        ],
        "year": "2023",
        "venue": "International Journal of Graph Networks",
        "doi link": "10.1016/j.graphnets.2023.102345",
        "method name": "HIBPool"
    },
    "relate work": {
        "related work category": [
            "Graph Pooling Methods",
            "Community Detection Algorithms"
        ],
        "related papers": "[1] C. Gao, Y. Ma, J. Xu, Q. Yang, Y. Tang, J. Lu, and E. O. Voit, 'Graph U-Net: Adaptive Pooling and Unpooling for Graph Neural Networks,' in ICML, 2019, 'Graph Pooling for Graph Neural Networks: A Closer Look.' [2] A. Lee, M. Kim, C. Hwang, H. Lee, 'SAGPool: Graph Pooling with Self-Attention and Graph Convolution in GNNs', 2020.",
        "comparisons with related methods": "The proposed method outperforms existing methods such as DIFFPOOL and Graph U-Net by effectively capturing community structures and reducing redundancy."
    },
    "high_level_summary": {
        "summary of this paper": "This paper introduces HIBPool, a novel community structure-aware pooling method that incorporates the Information Bottleneck principle to improve graph-level representations for classification tasks.",
        "research purpose": "To enhance graph classification accuracy by utilizing a pooling method that captures community structures and minimizes redundancy.",
        "research challenge": "Existing pooling methods fail to capture discriminative community structures and deal with redundancy effectively.",
        "method summary": "HIBPool uses community detection algorithms to form hierarchical graph representations and the Information Bottleneck principle to create more informative and less redundant graph summaries.",
        "conclusion": "HIBPool reliably improves graph classification accuracy and is resilient to feature perturbations, demonstrating a significant advantage over state-of-the-art pooling methods."
    },
    "Method": {
        "description": "HIBPool integrates community detection with a novel pooling strategy guided by the Information Bottleneck principle to enhance graph classification outcomes.",
        "problem formultaion": "Given a graph, partition it into communities and generate coarser representations maintaining graph structure integrity.",
        "feature processing": "Topological features and centrality measures are incorporated to assess community importance.",
        "model": "HIBPool leverages the Louvain algorithm for community detection and employs a readout operation constrained by the Information Bottleneck principle.",
        "tasks": [
            "Graph Classification"
        ],
        "theoretical analysis": "The HIBPool model maintains task-necessary information while minimizing the redundancy in data handling.",
        "complexity": "Addresses the computational complexity of community detection by partitioning graphs using the efficient Louvain algorithm. ",
        "algorithm step": "1. Detect communities using Louvain. 2. Apply Information Bottleneck guided pooling readout. 3. Generate coarser graph representations. 4. Compute graph-level summary."
    },
    "Experiments": {
        "datasets": [
            "ENZYMES",
            "DD",
            "PROTEINS",
            "NCI1",
            "NCI109",
            "FRANKENSTEIN"
        ],
        "baselines": [
            "DIFFPOOL",
            "Graph U-Net",
            "SAGPool",
            "MinCutPool",
            "ASAP",
            "GXN"
        ],
        "evaluation metric": "Average classification accuracy",
        "setup": "80% train, 10% validation, 10% test with 10-fold cross-validation",
        "hyperparameters": "Learning rate: 0.01, Optimizer: Adam",
        "results": "HIBPool achieves superior classification accuracy across all benchmarks, surpassing state-of-the-art methods significantly.",
        "performance": "HIBPool demonstrates both improved accuracy and feature perturbation robustness compared to existing methods.",
        "analysis": "Community-based pooling offers significant advances in capturing graph structure interactions, explaining HIBPool's competitive edge over similar models.",
        "ablation study": null
    },
    "conclusion": {
        "summary": "HIBPool outperforms current graph convolution methods in classifying graph-based data with increased accuracy and resilience to perturbations.",
        "future work": "Further exploration on resolving limitations such as the resolution limit of community detection algorithms is suggested."
    }
}