{
    "meta_data": {
        "title": "Global Homophily-based Graph Neural Networks for Heterophilous Graphs",
        "authors": [
            "John Doe",
            "Jane Smith"
        ],
        "affiliations": [
            "Department of Computer Science, University X",
            "Department of Machine Learning, Institute Y"
        ],
        "abstract": "In this paper, we address the problem of learning graph neural networks (GNNs) for heterophilous graphs, where nodes with dissimilar labels are likely connected. Traditional GNNs struggle with such graphs because they rely on the homophily assumption. We propose a novel GNN model called \\ada, which enhances performance on heterophilous graphs by leveraging global homophily, characterized by the set of distant homophilous nodes. Our approach captures this homophily using an expansion technique that alleviates over-smoothing and uses filtering mechanisms to improve node representation. We demonstrate the effectiveness of our model through extensive experiments on multiple datasets.",
        "keywords": [
            "Graph Neural Networks",
            "Heterophily",
            "Global Homophily",
            "Representation Learning"
        ],
        "year": "2023",
        "venue": "International Conference on Learning Representations (ICLR)",
        "doi link": "10.1001/iclr2023.9999",
        "method name": "\\ada"
    },
    "relate work": {
        "related work category": [
            "Graph Neural Networks",
            "Node Representation Learning",
            "Heterophilous Graphs"
        ],
        "related papers": "1. Kipf, T. N., & Welling, M. (2016). Semi-Supervised Classification with Graph Convolutional Networks. 2. Velickovic, P., et al. (2018). Graph Attention Networks. 3. Zhu, Y., et al. (2020). Beyond Homophily in Graph Neural Networks. 4. Lim, L. H., et al. (2021). Large-scale Benchmarks for Heterophilous Graph Learning.",
        "comparisons with related methods": "Our model \\ada stands out by utilizing global homophily and leveraging both low-pass and high-pass convolutional filters, whereas previous models often do not fully integrate global homophilous nodes or optimize for both filter types simultaneously."
    },
    "high_level_summary": {
        "summary of this paper": "This paper introduces \\ada, a novel GNN model that addresses the challenge of learning from heterophilous graphs by incorporating the concept of global homophily. \\ada constructs node embeddings using information from a wider range of homophilous nodes, improving model performance significantly on heterophilous graph benchmarks.",
        "research purpose": "To improve graph neural network performance on heterophilous graphs, where traditional GNNs face difficulties due to their reliance on local homophily in graphs.",
        "research challenge": "Effectively handling heterophilous graphs by extending the receptive field of GNNs to include global homophilous nodes without increasing computational complexity significantly.",
        "method summary": "\\ada expands the node neighborhood by incorporating multi-hop neighbors and utilizes both low-pass and high-pass filters to maintain a balanced node representation, allowing \\ada to exploit global homophilous nodes while minimizing inefficiencies.",
        "conclusion": "The \\ada model achieves superior performance in comparison to existing GNN models on heterophilous graphs by effectively merging nodes globally connected without label similarity, overcoming the limitations present in conventional GNNs."
    },
    "Method": {
        "description": "\\ada integrates a novel approach to consider global homophily by expanding the graph's receptive field using a coefficient matrix that assigns weights to nodes based on connectivity and potential label alignment over multiple hops. This strategic enhancement addresses the over-smoothing issue in existing models.",
        "problem formultaion": "To effectively use a global node set to predict labels for nodes in heterophilous graphs without performance loss due to computational complexity or noise.",
        "feature processing": "Utilizes multi-hop reachability to regularize node representation and capture nuanced similarities and differences in large heterophilous graphs.",
        "model": "The model employs a convolutional operation that uses combined low-pass and high-pass filters weighted by the coefficient matrix to generate embeddings from an expanded set of nodes.",
        "tasks": [
            "Node Classification",
            "Graph Representation"
        ],
        "theoretical analysis": "The grouping effect demonstrated in the paper ensures that nodes with similar features, even if distant, have similar representations, enhancing the effectiveness of \\ada on heterophilous graphs.",
        "complexity": "By reordering matrix computations, \\ada achieves linear complexity concerning the number of graph nodes, scaling efficiently while managing a large node neighborhood.",
        "algorithm step": "Leveraging high-pass and low-pass filters, \\ada formulates a closed-form solution to map features into embeddings, interpolating with global node characteristics."
    },
    "Experiments": {
        "datasets": [
            "Texas",
            "Wisconsin",
            "Cornell",
            "Actor",
            "Squirrel",
            "Chameleon",
            "Cora",
            "Citeseer",
            "Pubmed",
            "Penn94",
            "Pokec",
            "arXiv-year",
            "Snap-patents",
            "genius",
            "Twitch-gamers"
        ],
        "baselines": [
            "MLP",
            "GCN",
            "GAT",
            "MixHop",
            "GCN\\rom{2}",
            "H$_2$GCN",
            "WRGAT",
            "GPR-GNN",
            "GGCN",
            "ACM-GCN",
            "LINKX"
        ],
        "evaluation metric": "Accuracy and AUC scores on benchmark datasets",
        "setup": "Experiments conducted on both small-scale and large-scale datasets with various training setups and splits to ensure fairness and comprehensiveness in evaluative measures.",
        "hyperparameters": "Alpha blending of adjacency and feature matrices, regularization parameters for local graph structure, use of low-pass/high-pass filters, determined through grid search.",
        "results": "\\ada exhibits the best average performance across 15 datasets, outperforming conventional GNN, attention-based GCN, and MLP models.",
        "performance": "\\ada and \\ada++ demonstrate rapid convergence and wide applicability on heterophilous graphs, consistently outperforming baselines by utilizing global homophily.",
        "analysis": "Extensive comparative evaluation with baselines justifies that \\ada's methodology effectively captures global homophily, improving node classification predictions.",
        "ablation study": null
    },
    "conclusion": {
        "summary": "\\ada and \\ada++ efficiently leverage global homophily for improved node classification on heterophilous graphs, addressing existing GNN limitations by strategically expanding node neighborhood capabilities.",
        "future work": "Further exploration might include optimizing node embedding computations for extremely large datasets and integrating adaptive weighting based on dynamic graph structures."
    }
}