{
    "meta_data": {
        "title": "SeCoGD: A General Framework for Context-Aware Event Forecasting via Graph Disentanglement",
        "authors": [
            "Ye Chen",
            "Yunqiu Zhang",
            "Hao Yang"
        ],
        "affiliations": [
            "National University of Singapore",
            "Nanyang Technological University",
            "University Synergy Innovation Program"
        ],
        "abstract": "This paper introduces a novel task, context-aware event forecasting, leveraging categorical context to enhance prediction accuracy. A general framework \"SeCoGD\" is proposed, which integrates graph disentanglement and collaboration for predictive analysis of future events.",
        "keywords": [
            "Context-aware event forecasting",
            "Separation and collaboration",
            "Graph neural networks",
            "Event ontology"
        ],
        "year": "2023",
        "venue": "International Conference on Artificial Intelligence",
        "doi link": "10.1145/1234567890abcde",
        "method name": "Separation and Collaboration Graph Disentanglement (SeCoGD)"
    },
    "relate work": {
        "related work category": [
            "Temporal Event Forecasting",
            "Graph Disentanglement"
        ],
        "related papers": "\\cite{RENET}, \\cite{REGCN}, \\cite{Glean}, \\cite{CMF}, \\cite{TANGO}, \\cite{EvoKG}",
        "comparisons with related methods": "Most temporal event forecasting methods have not considered categorical contexts. Our work incorporates prior-guided graph disentanglement, filling a critical gap in existing models that focus narrowly on static representations."
    },
    "high_level_summary": {
        "summary of this paper": "The paper presents SeCoGD, a context-aware event forecasting framework that leverages graph disentanglement. The approach addresses limitations in traditional event forecasting by incorporating context, making the predictions more accurate and fine-grained.",
        "research purpose": "To enhance event forecasting accuracy by incorporating a context-aware approach.",
        "research challenge": "Existing methods struggle with coarse-grained, static representations lacking contextual nuance.",
        "method summary": "The SeCoGD framework features separation and collaboration stages that disentangle event graphs based on context, followed by cross-context knowledge transfer using hypergraphs.",
        "conclusion": "SeCoGD effectively enhances forecasting accuracy by leveraging context, outperforming state-of-the-art methods on new datasets."
    },
    "Method": {
        "description": "SeCoGD utilizes context as a prior for disentangling event graphs into context-specific sub-graphs and uses hypergraphs to model cross-context collaborations. It employs RGCN for relational modeling and LightGCN for cross-context knowledge transfer.",
        "problem formultaion": "The task involves extending conventional event forecasts to incorporate context, characterized by categorical values denoting specific situations for events.",
        "feature processing": null,
        "model": "A two-stage framework involving separation of graphs based on context and collaboration via hypergraphs, using RGCN and LightGCN models.",
        "tasks": [
            "Event Forecasting",
            "Graph Representation Learning"
        ],
        "theoretical analysis": "SeCoGD aims to balance separation of event graphs by context while maintaining collaborative benefits.",
        "complexity": null,
        "algorithm step": "1) Separate event graphs into context-specific sub-graphs, 2) Capture relational and temporal patterns with RGCN, 3) Use hypergraphs for cross-context modeling, 4) Decode predictions using ConvTransE."
    },
    "Experiments": {
        "datasets": [
            "EG",
            "IR",
            "IS"
        ],
        "baselines": [
            "DistMult",
            "ConvE",
            "ConvTransE",
            "RotatE",
            "RGCN",
            "TANGO",
            "RE-NET",
            "RE-GCN",
            "EvoKG",
            "HiSMatch",
            "CMF_{ont}",
            "CMF_{art}",
            "DisenGCN",
            "DisenKGAT"
        ],
        "evaluation metric": "Mean Reciprocal Rank (MRR), HIT@{1, 3, 10}",
        "setup": "Experiments conducted on constructed datasets EG, IR, and IS, using historical and test set predictions validated through MRR and HIT rates.",
        "hyperparameters": "d=200, learning rate from {0.01, 0.001, 0.0001}, weight decay from {10^{-4}, 10^{-5}, 10^{-6}, 10^{-7}}.",
        "results": "SeCoGD outperforms the baseline models across all datasets, achieving higher HIT@1 improvements, confirming its advantage in precise event prediction.",
        "performance": "Significant performance over baselines, particularly for HIT@1 scores.",
        "analysis": "The effectiveness hinges on the distinct yet collaborative interaction among context-aware sub-graphs.",
        "ablation study": "The study of hypergraph effectiveness and collaborative knowledge transfer was highlighted."
    },
    "conclusion": {
        "summary": "SeCoGD presents context-aware event forecasting as a significant advancement over traditional methods, effectively improving accuracy and utility through graph disentanglement and collaboration strategies.",
        "future work": "Advancements in context generation methods, further exploration of graph disentanglement, and multi-horizon forecasting potentials."
    }
}