{
    "meta_data": {
        "title": "Federated Conditional Policy for Personalized Federated Learning",
        "authors": [
            "First Author",
            "Second Author"
        ],
        "affiliations": [
            "Department of Computer Science, University X",
            "Institute for AI, University Y"
        ],
        "abstract": "Nowadays, many web-based services benefit from artificial intelligence (AI) and the large volume of data generated locally on various clients. However, due to privacy concerns, centralized AI faces significant challenges. Federated learning (FL) is proposed to utilize local data without sharing private information. To address the challenge of statistical heterogeneity, personalized federated learning (pFL) focuses on learning personalized models instead of a single global model. Existing pFL methods often only exploit global/personalized information in model parameters. We propose a Federated Conditional Policy (Method) based on conditional computing techniques to separate global and personalized information in data. Our auxiliary Conditional Policy Network generates sample-specific policies for feature separation, which are processed by a global and a personalized head. Our approach outperforms eleven state-of-the-art methods across various settings and adapts to unstable client participations.",
        "keywords": [
            "Federated Learning",
            "Personalized Learning",
            "Conditional Computing",
            "Data Privacy"
        ],
        "year": "2023",
        "venue": "Journal of Machine Learning Research",
        "doi link": "https://doi.org/example",
        "method name": "Federated Conditional Policy"
    },
    "relate work": {
        "related work category": [
            "Federated Learning",
            "Personalized Federated Learning",
            "Conditional Computing"
        ],
        "related papers": "Federated Learning: FedAvg, FedProx; Personalized Federated Learning: Per-FedAvg, pFedMe, FedAMP, Ditto, FedPer, FedRep, FedRoD, FedFomo, FedPHP; Conditional Computing: ConvNet-AIG, SpotTune, TADAM, TMA",
        "comparisons with related methods": "The proposed method differs from FedAvg in its ability to customize individual client models to address statistical heterogeneity problems. Different from meta-learning-based approaches, it learns sample-specific feature separation policies, not just client-level model parameters. This strategy allows effective sharing of globally useful information while maintaining personalization."
    },
    "high_level_summary": {
        "summary of this paper": "This paper introduces a new approach called Federated Conditional Policy (FedCP) for Personalizing Federated Learning (pFL), which separates global and personalized feature information in data using a Conditional Policy Network and processes them with specified heads. This approach handles statistical heterogeneity more effectively and adapts well to client dropout scenarios.",
        "research purpose": "Improve federated learning by enabling personalized model training on non-IID and unbalanced client data.",
        "research challenge": "Overcoming statistical heterogeneity issues and privacy-preserving model updates in federated learning.",
        "method summary": "FedCP learns sample-specific policies for separating and handling global and personalized features using conditional computing techniques. It trains personalized and global heads separately to optimize information derived from clients' data.",
        "conclusion": "FedCP outperforms existing methods in various scenarios, maintaining robust performance and privacy-preserving ability even with client dropouts."
    },
    "Method": {
        "description": "FedCP employs a conditional policy network that automatically generates sample-specific policies for feature separation in federated settings.",
        "problem formultaion": "The target is to create a federated learning method capable of effective customization in the absence of data sharing due to privacy concerns, addressing the challenge of statistical heterogeneity.",
        "feature processing": "Features are separated into global and personalized information using sample-specific policies generated by the policy network.",
        "model": "The model comprises a global feature extractor, global and personalized heads, and a conditional policy network for handling samples.",
        "tasks": [
            "Image Classification",
            "Text Classification"
        ],
        "theoretical analysis": "The sample-specific policy generation ensures separation of global and personalized data inherently derived from client data.",
        "complexity": "The policy component introduces slight communication and computational overhead, accounting for less than 5% additional resources over baseline methods.",
        "algorithm step": "FedCP performs iterative client model update, parameter aggregation on the server, and subsequent feature alignment using maximum mean discrepancy (MMD) for personalization."
    },
    "Experiments": {
        "datasets": [
            "MNIST",
            "Cifar10",
            "Cifar100",
            "Tiny-ImageNet",
            "AG News"
        ],
        "baselines": [
            "FedAvg",
            "FedProx",
            "Per-FedAvg",
            "pFedMe",
            "FedAMP",
            "Ditto",
            "FedPer",
            "FedRep",
            "FedRoD",
            "FedFomo",
            "FedPHP"
        ],
        "evaluation metric": "Test accuracy and computational overhead are the primary metrics.",
        "setup": "Experiments simulate federated environments with pathological and practical settings across image and text domains.",
        "hyperparameters": "Optimal learning rates were determined through grid search, specific λ values for different tasks aligned the output features effectively.",
        "results": "FedCP consistently outperforms in both pathological and practical federated settings, achieving up to 6.69% improvement over baselines in certain instances.",
        "performance": "It remains effective even when some clients drop out, preserving stable performance and surpassing baseline models.",
        "analysis": "The analysis highlighted the critical role of sample-specific feature separation and alignment through the global and personalized heads as a determinant in the method's superior performance.",
        "ablation study": "Ablation studies confirm that the presence of the conditional policy and feature alignment mechanisms are central to the method's effectiveness."
    },
    "conclusion": {
        "summary": "FedCP introduces a paradigm shift in federated learning by leveraging conditional policy networks to tackle heterogeneity and privacy without sharing data. Its robust framework offers superior personalization, boosting model performance.",
        "future work": "Expanding the method to cover more comprehensive tasks beyond classification, potentially increasing its adaptability across various federated domains."
    }
}