{
    "meta_data": {
        "title": "Self-Supervised Knowledge Graph-enhanced Recommender Systems",
        "authors": [
            "Y. Zhang",
            "J. Liu",
            "W. Chen"
        ],
        "affiliations": [
            "Department of Computer Science, XYZ University",
            "Institute for AI, ABC University"
        ],
        "abstract": "Recommender systems play a crucial role in helping users find relevant content across various domains. Knowledge graphs (KGs) have emerged as a unique source of information in enhancing state-of-the-art recommender systems. In this paper, we propose a novel self-supervised learning model for knowledge graph-enhanced recommendation, leveraging the hierarchical rationale of knowledge triplets within the graph structure. Our method performs attentive knowledge rationalization and exploits both generative and contrastive self-supervised learning to enhance recommendation accuracy. We validate our model's performance through extensive empirical studies across real-world datasets, demonstrating its superiority over competitive baselines.",
        "keywords": [
            "Recommender systems",
            "Knowledge graphs",
            "Self-supervised learning",
            "Hierarchical rationale",
            "Recommendation accuracy"
        ],
        "year": "2023",
        "venue": "International Conference on Machine Learning (ICML)",
        "doi link": "10.1234/icml2023.4567",
        "method name": "Self-supervised Knowledge-enhanced Recommender Model (\\model)"
    },
    "relate work": {
        "related work category": [
            "Embedding-based Methods",
            "Path-based Methods",
            "GNN-based Methods",
            "Self-Supervised Learning for Recommendation",
            "Knowledge Graph-enhanced Recommendation"
        ],
        "related papers": "CKE ~\\cite{cke}, KPRN ~\\cite{kprn}, KGAT ~\\cite{kgat}, SGL ~\\cite{sgl}, KGCL ~\\cite{kgcl}, MCCLK ~\\cite{mcclk}",
        "comparisons with related methods": "Our model outperforms traditional embedding-based methods and recent GNN-based approaches by efficiently coordinating cross-view knowledge contrastive learning and rational masking. The superior performance is attributed to the use of rationale-aware masking which filters out noisy knowledge connections, unlike random graph augmentation by others."
    },
    "high_level_summary": {
        "summary of this paper": "This paper presents \\model, a breakthrough in utilizing self-supervised learning techniques to enhance knowledge graph-powered recommendation systems. The core advancement is the dual use of rationale knowledge masking and contrastive learning to sift and align informative data from knowledge graphs, augmenting both user-content and knowledge-space embeddings.",
        "research purpose": "The objective is to tackle inherent data sparsity and noise issues in existing recommendation systems by employing advanced self-supervised techniques using knowledge graphs, thus enriching the representation of item and user data.",
        "research challenge": "Integrating knowledge graphs into recommender systems often introduces complexity and noise, which must be refined to extract meaningful insights for accurate recommendations.",
        "method summary": "\\model utilizes rationale-based knowledge masking and cross-view contrastive learning, aligning knowledge graph embeddings with user-item interactions for superior recommendation performance.",
        "conclusion": "Through extensive experiments on real-world datasets, \\model showcases its efficacy by surpassing competitive models. It stratifies knowledge graph embeddings effectively, emphasizing useful triplets while filtering out noise, thereby optimizing recommendation results."
    },
    "Method": {
        "description": "\\model is grounded in the stratification of knowledge triplets through attentive knowledge rationalization to enhance recommendations. It utilizes advanced self-supervised learning paradigms to refine noise from knowledge graphs by masking irrelevant data and accentuating informative triplets.",
        "problem formultaion": "Given a user-item interaction graph, and an associated knowledge graph, the objective is to develop a model that accurately predicts user interaction with items by enhancing embeddings using knowledge graph data.",
        "feature processing": null,
        "model": "\\model employs a dual-pronged approach: rationale-aware masking to highlight relevant knowledge triplets, and contrastive learning syncing cross-view signals to finely tune user and item embeddings.",
        "tasks": [
            "Knowledge triplet rationalization",
            "Masking and reconstruction learning",
            "Cross-view contrastive learning"
        ],
        "theoretical analysis": null,
        "complexity": null,
        "algorithm step": null
    },
    "Experiments": {
        "datasets": [
            "Last-FM",
            "MIND",
            "Alibaba-iFashion"
        ],
        "baselines": [
            "BPR",
            "NeuMF",
            "LightGCN",
            "KGCL",
            "MCCLK"
        ],
        "evaluation metric": "Recall@N, NDCG@N",
        "setup": "Compare proposed method against baseline methods using Recall@N and NDCG@N benchmarks across Last-FM, MIND, and Alibaba-iFashion datasets. Testing is executed in a full-rank setting with a 70/10/20 train/validation/test split.",
        "hyperparameters": "Various masking sizes, contrastive learning proportions, and contrastive learning temperature settings were fine-tuned to evaluate \\model's performance.",
        "results": "\\model consistently outperformed all baselines across three datasets, with compelling evidence in recommendation accuracy and robustness under sparse data conditions.",
        "performance": "Better handling of cold-start and long-tail recommendations, significant improvement over state-of-the-art models.",
        "analysis": "\\model's ability to utilize knowledge graph rationales enhances interpretability, with experiments demonstrating effective noise filtering and relevance focusing.",
        "ablation study": null
    },
    "conclusion": {
        "summary": "The paper illustrates an advanced recommender framework that incorporates self-supervised insights from knowledge graphs, enhancing prediction accuracy while mitigating noise impact.",
        "future work": "Explore more complex knowledge graph rationalization methods such as graph structure learning and graph sparsification."
    }
}