{
    "meta_data": {
        "title": "Adaptive Multi-Interest Debiasing Framework for Cross-Domain Sequential Recommendation Under Open-World Assumptions",
        "authors": [
            "John Doe",
            "Jane Smith",
            "Albert Johnson"
        ],
        "affiliations": [
            "Department of Computer Science, University of Nowhere",
            "Institute of Data Science, University of Everywhere"
        ],
        "abstract": "This study introduces a new framework, AMID, designed to address the open-world challenges in cross-domain sequential recommendation (CDSR). By leveraging adaptive multi-interest modeling and debiasing techniques, AMID effectively mitigates selection bias and utilizes non-overlapping users. Comprehensive experiments demonstrate its superiority over existing CDSR methods.",
        "keywords": [
            "Cross-Domain Sequential Recommendation",
            "Open-World Assumptions",
            "Debiasing Methods",
            "Multi-Interest Modeling"
        ],
        "year": "2023",
        "venue": "International Conference on Machine Learning",
        "doi link": "10.5555/ICML123456",
        "method name": "AMID"
    },
    "relate work": {
        "related work category": [
            "Conventional Cross-Domain Recommendation",
            "Cross-Domain Sequential Recommendation",
            "Multi-interest Recommendation",
            "Debias for Recommender Systems"
        ],
        "related papers": "- Hu et al. 2018. \"Conet: A Collaborative Neural Network for Ranking Cross-domain Recommendations\"\n- Ma et al. 2019. \"Pi-Net: A Parallel Information Transfer Network for Shared-Account Cross-Domain Sequential Recommendation\"\n- Sheng et al. 2021. \"STAR: A Next Generation Cross-Domain Recommendation Framework\"\n- Ricci et al. 2009. \"Recommender Systems Handbook: A Comprehensive Guide\"",
        "comparisons with related methods": "AMID is distinct from traditional CDSR methods as it focuses on non-overlapping users and traverses open-world domains, offering solutions for selection biases not addressed by conventional models."
    },
    "high_level_summary": {
        "summary of this paper": "This paper presents an innovative framework termed AMID that targets the limitations of existing cross-domain sequential recommendation methods under open-world settings. It achieves this by incorporating adaptive multi-interest modeling and a doubly robust estimator to address selection bias and enhance prediction accuracy.",
        "research purpose": "To overcome the limitations of traditional CDSR models by constructing a framework capable of handling non-overlapping users and reducing biases inherent in open-world scenarios.",
        "research challenge": "Only partial solutions exist for non-overlapping user data and selection bias in traditional CDSR settings, necessitating a novel framework like AMID.",
        "method summary": "AMID employs a foundational framework that uses a multi-interest information module (MIM) and a doubly robust estimator (DRE) to model sequences accurately, mitigating bias and enhancing predictive performance.",
        "conclusion": "The AMID framework effectively addresses major challenges in cross-domain sequential recommendation scenarios, establishing a new benchmark for future applications."
    },
    "Method": {
        "description": "AMID employs adaptive multi-interest and debiasing strategies to handle open-world cross-domain sequential recommendation challenges.",
        "problem formultaion": "Modeling sequences for partially overlapping environments with selection bias correction.",
        "feature processing": "NA",
        "model": "AMID integrates single-domain sequential recommendation systems with a multi-interest information module and doubly robust estimator.",
        "tasks": [
            "Cross-domain recommendation",
            "Sequential behavior modeling",
            "Bias reduction"
        ],
        "theoretical analysis": "The paper presents a theoretical evaluation demonstrating the superior bias and convergence properties of the AMID estimator.",
        "complexity": "The paper identifies the effort required for group construction with a complexity of O(Z²), suggesting future efficiency improvements.",
        "algorithm step": "The algorithm consists of interest group formation, cross-domain propagation, and a prediction layer executed in training phases with empirical evaluations."
    },
    "Experiments": {
        "datasets": [
            "Amazon Cloth-Sport",
            "Amazon Phone-Elec",
            "MYbank Loan-Fund",
            "MYbank Loan-Account"
        ],
        "baselines": [
            "BERT4Rec",
            "GRU4Rec",
            "SASRec",
            "STAR",
            "MAMDR",
            "Pi-Net",
            "DASL",
            "C2DSR",
            "DCRec",
            "CaseQ",
            "IPSCDR"
        ],
        "evaluation metric": "NDCG, Hit Rate, Conversion Rate",
        "setup": "Experiments were conducted using Amazon and MYbank datasets for cross-dataset validation in platforms with varying user overlaps.",
        "hyperparameters": "Common hyperparameters such as embedding dimensions of 128, batch sizes of 512, learning rates of 0.001 were uniformly applied.",
        "results": "AMID outperformed existing methods with improvements: 26.48% (in NDCG) on Cloth domain and 5.60% in Fund domain scenarios, establishing its superiority in various tasks.",
        "performance": "The AMID framework demonstrated significant performance enhancements across all tested domains, particularly with high non-overlapping user ratios.",
        "analysis": "AMID's methods reveal high effectiveness in attenuating selection bias and consolidating cross-domain preferences.",
        "ablation study": "An ablation study confirmed the effectiveness of key components like MIM, showing even without DRE, substantial performance was yielded."
    },
    "conclusion": {
        "summary": "This paper presents AMID, an adaptive multi-interest debiasing framework that effectively handles cross-domain sequential recommendation challenges in open-world settings.",
        "future work": "Future work will explore more efficient group construction methods to address increasing domain numbers and enhance AMID's scalability."
    }
}